--Выберите все колонки из таблицы orders и дополнительно в качестве последней колонки укажите функцию unnest, 
--применённую к колонке product_ids. Эту последнюю колонку назовите product_id. Больше ничего с данными делать не нужно.

--Добавьте в запрос оператор LIMIT и выведите только первые 100 записей результирующей таблицы.

--Поля в результирующей таблице: creation_time, order_id, product_ids, product_id

--Посмотрите на результат работы функции unnest и постарайтесь разобраться, что произошло с исходной таблицей.

SELECT creation_time,
       order_id,
       product_ids,
       unnest(product_ids) AS product_id
FROM orders
LIMIT 100;
